# IsValidReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementPath..::..IsValidReference Method
DisplacementPath Class See Also
---
Does the specified pick represent an edge or a curve belonging to one of the displaced elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsValidReference(
	DisplacementElement displacementElement,
	Reference reference
)
```

Visual Basic
---
```text
Public Shared Function IsValidReference ( _
	displacementElement As DisplacementElement, _
	reference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidReference(
	DisplacementElement^ displacementElement,
	Reference^ reference
)
```

# ### Parameters
displacementElement
    Type: Autodesk.Revit.DB..::..DisplacementElement A DisplacementElement.
reference
    Type: Autodesk.Revit.DB..::..Reference A pick.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DisplacementPath Class
Autodesk.Revit.DB Namespace